In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv('indian_sales_sample.csv')

In [7]:
df.head()

,id,date,product,brand,quantity,price_per_unit,total,customer,city
0,1,1/1/1900,Amul Butter 500g,Amul,2,275,550,Rohan Mehta,Mumbai
1,2,9/23/1901,Tata Tea Gold 1kg,Tata,1,520,520,Sneha Sharma,Delhi
2,3,1/2/1900,Parle-G Biscuits 12-pack,Parle,3,40,120,Vikas Singh,Lucknow
3,4,10/4/2025,Reliance Jio Recharge 399 Plan,Reliance Jio,1,399,399,Aarti Nair,Bangalore
4,5,10/5/2025,Godrej Hair Colour 100ml,Godrej,2,190,380,Sandeep Patel,Ahmedabad

In [8]:
dh = pd.read_csv('indian_sales_sample.csv', header=None) #jo by deflit first row ko padas samjh raha collum name app bata sakte ho ki  first row collum name nahi samjhe header=None

In [9]:
dh

,0,1,2,3,4,5,6,7,8
0,id,date,product,brand,quantity,price_per_unit,total,customer,city
1,1,1/1/1900,Amul Butter 500g,Amul,2,275,550,Rohan Mehta,Mumbai
2,2,9/23/1901,Tata Tea Gold 1kg,Tata,1,520,520,Sneha Sharma,Delhi
3,3,1/2/1900,Parle-G Biscuits 12-pack,Parle,3,40,120,Vikas Singh,Lucknow
4,4,10/4/2025,Reliance Jio Recharge 399 Plan,Reliance Jio,1,399,399,Aarti Nair,Bangalore
5,5,10/5/2025,Godrej Hair Colour 100ml,Godrej,2,190,380,Sandeep Patel,Ahmedabad
6,6,10/6/2025,Dabur Honey 500g,Dabur,1,285,285,Priya Iyer,Chennai
7,7,10/7/2025,Haldiram Soan Papdi 250g,Haldiram,4,120,480,Manoj Gupta,Jaipur
8,8,10/8/2025,Britannia Cheese 200g,Britannia,5,150,750,Kiran Das,Kolkata
9,9,10/9/2025,Patanjali Dant Kanti Toothpaste,Patanjali,3,85,255,Rita Reddy,Hyderabad
10,10,1/1/1900,Bajaj LED Bulb 9W,Bajaj,6,130,780,Sajan Kumar,Patna

In [10]:
df.head(3)

,id,date,product,brand,quantity,price_per_unit,total,customer,city
0,1,1/1/1900,Amul Butter 500g,Amul,2,275,550,Rohan Mehta,Mumbai
1,2,9/23/1901,Tata Tea Gold 1kg,Tata,1,520,520,Sneha Sharma,Delhi
2,3,1/2/1900,Parle-G Biscuits 12-pack,Parle,3,40,120,Vikas Singh,Lucknow

In [11]:
df.tail()

,id,date,product,brand,quantity,price_per_unit,total,customer,city
5,6,10/6/2025,Dabur Honey 500g,Dabur,1,285,285,Priya Iyer,Chennai
6,7,10/7/2025,Haldiram Soan Papdi 250g,Haldiram,4,120,480,Manoj Gupta,Jaipur
7,8,10/8/2025,Britannia Cheese 200g,Britannia,5,150,750,Kiran Das,Kolkata
8,9,10/9/2025,Patanjali Dant Kanti Toothpaste,Patanjali,3,85,255,Rita Reddy,Hyderabad
9,10,1/1/1900,Bajaj LED Bulb 9W,Bajaj,6,130,780,Sajan Kumar,Patna

In [12]:
df.tail(3)

,id,date,product,brand,quantity,price_per_unit,total,customer,city
7,8,10/8/2025,Britannia Cheese 200g,Britannia,5,150,750,Kiran Das,Kolkata
8,9,10/9/2025,Patanjali Dant Kanti Toothpaste,Patanjali,3,85,255,Rita Reddy,Hyderabad
9,10,1/1/1900,Bajaj LED Bulb 9W,Bajaj,6,130,780,Sajan Kumar,Patna

In [13]:
type(df) # datafram kya tablerstructure matlab like a table jism sab structure from me  data hota hai

pandas.core.frame.DataFrame

In [14]:
list(df.columns)

['id',
 'date',
 'product',
 'brand',
 'quantity',
 'price_per_unit',
 'total',
 'customer',
 'city']

In [15]:
df['brand']

0            Amul
1            Tata
2           Parle
3    Reliance Jio
4          Godrej
5           Dabur
6        Haldiram
7       Britannia
8       Patanjali
9           Bajaj
Name: brand, dtype: object

In [16]:
type(df['brand']) # list=Series same same but series show index but list not show index list bhi index me data hota ahi

pandas.core.series.Series

In [17]:
list(df['brand'])

['Amul',
 'Tata',
 'Parle',
 'Reliance Jio',
 'Godrej',
 'Dabur',
 'Haldiram',
 'Britannia',
 'Patanjali',
 'Bajaj']

In [18]:
df[['brand']]

          brand
0          Amul
1          Tata
2         Parle
3  Reliance Jio
4        Godrej
5         Dabur
6      Haldiram
7     Britannia
8     Patanjali
9         Bajaj

In [19]:
type(df[['brand']]) # collum name ko list[] me pass krya ja raha hai

pandas.core.frame.DataFrame

In [20]:
df.columns

Index(['id', 'date', 'product', 'brand', 'quantity', 'price_per_unit', 'total',
       'customer', 'city'],
      dtype='object')

In [21]:
df['id','date']

KeyError: ('id', 'date')

In [ ]:
df[['id','date']]

In [22]:
df.dtypes #object = string pands dtypes apene hi sab se samjhata hai

id                 int64
date              object
product           object
brand             object
quantity           int64
price_per_unit     int64
total              int64
customer          object
city              object
dtype: object

In [23]:
i = 2/20/2025

o Python ise math expression samajh kar divide karta hai —
2 ÷ 20 ÷ 2025 karke result nikalta hai.

Lekin jab pandas CSV file se "2/20/2025" padhta hai,
to pandas ise text (string) samajhta hai —
wo ise math ke hisaab se calculate nahi karta, bas “as it is” likha hua text hi rakhta hai.

In [24]:
type(i)

float

In [25]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [26]:
df1 = pd.read_excel("excal sheet.xlsx") # excal me bahut sheet hota hai bydefoalt pands read karta first sheet ko

In [27]:
df2 = pd.read_excel("excal sheet.xlsx",sheet_name="Sheet2")

In [28]:
type(df1)

pandas.core.frame.DataFrame

In [29]:
df1.dtypes

Col1      int64
Col2     object
Col3      int64
Col4     object
Col5      int64
Col6     object
Col7      int64
Col8     object
Col9      int64
Col10    object
dtype: object

In [30]:
df1.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Col5', 'Col6', 'Col7', 'Col8', 'Col9',
       'Col10'],
      dtype='object')

In [31]:
df1[['Col1', 'Col2']]

   Col1   Col2
0    46  Sajan
1    27   Aman
2    81   Neha
3    92  Kiran
4    38   Aman
5    90   Ravi
6    25  Sajan
7    62   Aman
8    48   Neha
9    20   Aman

In [32]:
df3 = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv")

In [33]:
df3.head(4)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa

In [34]:
df3.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [35]:
type(df3)

pandas.core.frame.DataFrame

In [36]:

df3['sepal_length'] # ager bahut recod hoga ... dekha dega tume fill me save karke dekhana hoga

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [37]:
type(df3['sepal_length'] )

pandas.core.series.Series

In [38]:
df3[['sepal_length', 'sepal_width']]

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [39]:
df3.tail(3)

     sepal_length  sepal_width  petal_length  petal_width    species
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [40]:
pip install  lxml

Requirement already satisfied: lxml in c:\users\frontech\.conda\envs\mynewenv\lib\site-packages (6.0.2)
Note: you may need to restart the kernel to use updated packages.

In [41]:

url_data = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2020.html") # pands sif web ko puri ko read nahi krega sif table ko

In [42]:
type(url_data) #ager o ak table tab to bhi  list ke nder ragega matlb html ko read kareke list ke ander klhata ahi

list

In [43]:
len(url_data) # len ka mtalab number of table pata hai

13

In [44]:
df4 = url_data[0] #index kya karta ahi table ko number assign karta  hai jo  0 se start

In [45]:
df4

     Eastern Conference   W   L   W/L%    GB   PS/G   PA/G   SRS
0      Milwaukee Bucks*  56  17  0.767     —  118.7  108.6  9.41
1      Toronto Raptors*  53  19  0.736   2.5  112.8  106.5  5.97
2       Boston Celtics*  48  24  0.667   7.5  113.7  107.3  5.83
3       Indiana Pacers*  45  28  0.616  11.0  109.4  107.5  1.63
4           Miami Heat*  44  29  0.603  12.0  112.0  109.1  2.59
5   Philadelphia 76ers*  43  30  0.589  13.0  110.7  108.4  2.25
6        Brooklyn Nets*  35  37  0.486  20.5  111.8  112.3 -1.01
7        Orlando Magic*  33  40  0.452  23.0  107.3  108.3 -0.93
8     Charlotte Hornets  23  42  0.354  29.0  102.9  109.6 -7.03
9    Washington Wizards  25  47  0.347  30.5  114.4  119.1 -5.24
10        Chicago Bulls  22  43  0.338  30.0  106.8  109.9 -4.00
11      New York Knicks  21  45  0.318  31.5  105.8  112.3 -6.72
12      Detroit Pistons  20  46  0.303  32.5  107.2  110.8 -4.38
13        Atlanta Hawks  20  47  0.299  33.0  111.8  119.7 -7.71
14  Cleveland Cavaliers  19  46  0.292  33.0  106.9  114.8 -7.77

In [46]:
df5 = url_data[1]

In [47]:
df5

         Western Conference   W   L   W/L%    GB   PS/G   PA/G   SRS
0       Los Angeles Lakers*  52  19  0.732     —  113.4  107.6  6.28
1     Los Angeles Clippers*  49  23  0.681   3.5  116.3  109.9  6.66
2           Denver Nuggets*  46  27  0.630   7.0  111.3  109.2  2.35
3          Houston Rockets*  44  28  0.611   8.5  117.8  114.8  3.13
4    Oklahoma City Thunder*  44  28  0.611   8.5  110.4  108.4  2.33
5                Utah Jazz*  44  28  0.611   8.5  111.3  108.8  2.52
6         Dallas Mavericks*  43  32  0.573  11.0  117.0  112.1  4.87
7   Portland Trail Blazers*  35  39  0.473  18.5  115.0  116.1 -0.61
8         Memphis Grizzlies  34  39  0.466  19.0  112.6  113.7 -0.91
9              Phoenix Suns  34  39  0.466  19.0  113.6  113.4  0.56
10        San Antonio Spurs  32  39  0.451  20.0  114.1  115.2 -0.65
11         Sacramento Kings  31  41  0.431  21.5  110.1  112.1 -1.59
12     New Orleans Pelicans  30  42  0.417  22.5  115.8  117.1 -0.55
13   Minnesota Timberwolves  19  45  0.297  29.5  113.3  117.5 -4.02
14    Golden State Warriors  15  50  0.231  34.0  106.3  115.0 -8.12

In [48]:
df5.head()

       Western Conference   W   L   W/L%   GB   PS/G   PA/G   SRS
0     Los Angeles Lakers*  52  19  0.732    —  113.4  107.6  6.28
1   Los Angeles Clippers*  49  23  0.681  3.5  116.3  109.9  6.66
2         Denver Nuggets*  46  27  0.630  7.0  111.3  109.2  2.35
3        Houston Rockets*  44  28  0.611  8.5  117.8  114.8  3.13
4  Oklahoma City Thunder*  44  28  0.611  8.5  110.4  108.4  2.33

In [49]:
df5.tail()

        Western Conference   W   L   W/L%    GB   PS/G   PA/G   SRS
10       San Antonio Spurs  32  39  0.451  20.0  114.1  115.2 -0.65
11        Sacramento Kings  31  41  0.431  21.5  110.1  112.1 -1.59
12    New Orleans Pelicans  30  42  0.417  22.5  115.8  117.1 -0.55
13  Minnesota Timberwolves  19  45  0.297  29.5  113.3  117.5 -4.02
14   Golden State Warriors  15  50  0.231  34.0  106.3  115.0 -8.12

In [50]:
df5.columns

Index(['Western Conference', 'W', 'L', 'W/L%', 'GB', 'PS/G', 'PA/G', 'SRS'], dtype='object')

In [51]:
df5.dtypes

Western Conference     object
W                       int64
L                       int64
W/L%                  float64
GB                     object
PS/G                  float64
PA/G                  float64
SRS                   float64
dtype: object

In [52]:
df5['Western Conference']

0         Los Angeles Lakers*
1       Los Angeles Clippers*
2             Denver Nuggets*
3            Houston Rockets*
4      Oklahoma City Thunder*
5                  Utah Jazz*
6           Dallas Mavericks*
7     Portland Trail Blazers*
8           Memphis Grizzlies
9                Phoenix Suns
10          San Antonio Spurs
11           Sacramento Kings
12       New Orleans Pelicans
13     Minnesota Timberwolves
14      Golden State Warriors
Name: Western Conference, dtype: object

In [53]:
df5.to_csv("player_data.csv",index= False)